/*-< 演習：Ex1_08_1 >---------------------------------
コメントの内容に従ってプログラムを作成してください。
----------------------------------------------------*/
class Ex1_08_1 {
	public static void main (String[] args) {
		
		/* (1) 以下の配列を準備してください。
		**     配列名    ：names
		**     保持する値：「taro」「takeshi」「hanako」「moco」「satoshi」
		*/
		
		
		
		
		/* (2) 以下のアンダーバーを埋め、
		**     names配列から「moco」の値を表示するプログラムに修正してください。
		*/
		String printName = ______ ;         //(21行目)アンダーバーに適切な処理を埋めてください
		System.out.println( printName );    //(22行目)変更しないでください
		
	}
}
